/*
将以下下数据存入到 student 数据表
('胡秀英', 77, 75, 51),
('李玉珍', 58, 40, 72),
('王超', 78, 96, 56),
('宋婷', 99, 64, 84),
('吴桂香', 75, 92, 43),
('范鹏', 94, 93, 95),
('钟淑兰', 70, 80, 46),
('刘桂芝', 49, 59, 94),
('王畅', 66, 64, 96),
('谢秀华', 78, 63, 59),
('王宇', 59, 66, 94),
('陈兰英', 67, 44, 71),
('杜刚', 44, 82, 92),
('鲁超', 62, 85, 59),
('陈静', 53, 51, 81),
('郑玉梅', 51, 72, 57),
('郭丹丹', 40, 44, 81),
('李玉兰', 94, 68, 74),
('高刚', 95, 89, 74),
('张成', 96, 52, 78),
*/

use
0115_01_15107916


create table student3
(
    id      int primary key auto_increment,
    name    varchar(255),
    chinese int(255),
    math    varchar(255),
    english varchar(255)

);

insert into student
values (0, '李玉珍', 58, 40, 72),
       (0, '王超', 78, 96, 56),
       (0, '宋婷', 99, 64, 84),
       (0, '吴桂香', 75, 92, 43),
       (0, '范鹏', 94, 93, 95),
       (0, '钟淑兰', 70, 80, 46),
       (0, '刘桂芝', 49, 59, 94),
       (0, '王畅', 66, 64, 96),
       (0, '谢秀华', 78, 63, 59),
       (0, '王宇', 59, 66, 94),
       (0, '陈兰英', 67, 44, 71),
       (0, '杜刚', 44, 82, 92),
       (0, '鲁超', 62, 85, 59),
       (0, '陈静', 53, 51, 81),
       (0, '郑玉梅', 51, 72, 57),
       (0, '郭丹丹', 40, 44, 81),
       (0, '李玉兰', 94, 68, 74),
       (0, '高刚', 95, 89, 74),
       (0, '张成', 96, 52, 78)

select *
from student2
where name = %s

insert
into student3
    value (0, '李玉珍', '58', 40, 72)